In [4]:
import numpy as np
import pandas as pd

In [5]:
myDictionary = {"James": [40,30,np.nan], "Kirk": [20,np.nan,50], "Lars": [30,50,40]}

In [6]:
myDataFrame = pd.DataFrame(myDictionary)

In [7]:
myDataFrame

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [8]:
myDataFrame.dropna()

   James  Kirk  Lars
0   40.0  20.0    30

In [9]:
myDataFrame.dropna(axis=1)

   Lars
0    30
1    50
2    40

In [10]:
myNewDictionary = {"James": [40,30,np.nan], "Kirk": [20,np.nan,50], "Lars": [30,50,40], "Rob":[45, np.nan, np.nan]}

In [11]:
myNewDataFrame = pd.DataFrame(myNewDictionary)

In [12]:
myNewDataFrame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0   NaN    50   NaN
2    NaN  50.0    40   NaN

In [13]:
myNewDataFrame.dropna(axis=1, thresh=2)

   James  Kirk  Lars
0   40.0  20.0    30
1   30.0   NaN    50
2    NaN  50.0    40

In [14]:
myNewDataFrame.fillna(20, inplace=True)

In [15]:
myNewDataFrame

   James  Kirk  Lars   Rob
0   40.0  20.0    30  45.0
1   30.0  20.0    50  20.0
2   20.0  50.0    40  20.0

In [16]:
#groupby

In [17]:
salaryDict = {"Programming Language": ["Python", "Python", "Python", "Java", "Java", "Swift"], "Name": ["A", "B", "C", "D", "E", "F"], "Salary": [100, 90, 80, 70, 60, 50]}

In [18]:
salaryFrame = pd.DataFrame(salaryDict)

In [19]:
salaryFrame

  Programming Language Name  Salary
0               Python    A     100
1               Python    B      90
2               Python    C      80
3                 Java    D      70
4                 Java    E      60
5                Swift    F      50

In [26]:
groupObject = salaryFrame.groupby("Programming Language")

In [27]:
groupObject

In [21]:
groupObject.count()

                      Name  Salary
Programming Language
Java                     2       2
Python                   3       3
Swift                    1       1

In [22]:
groupObject.max("Salary")

                      Salary
Programming Language
Java                      70
Python                   100
Swift                     50

In [23]:
groupObject.mean("Salary")

                      Salary
Programming Language
Java                    65.0
Python                  90.0
Swift                   50.0

In [24]:
groupObject.mean(numeric_only=True)

                      Salary
Programming Language
Java                    65.0
Python                  90.0
Swift                   50.0

In [25]:
groupObject.describe()

                     Salary
                      count  mean        std   min   25%   50%   75%    max
Programming Language
Java                    2.0  65.0   7.071068  60.0  62.5  65.0  67.5   70.0
Python                  3.0  90.0  10.000000  80.0  85.0  90.0  95.0  100.0
Swift                   1.0  50.0        NaN  50.0  50.0  50.0  50.0   50.0

In [62]:
myDict1 = {"Name": ["A", "B", "C", "D"],
           "Sports": ["Basketball", "Football", "Tennis", "Running"],
           "Calories": [100, 200, 300, 400]
          }

In [63]:
myFrame1 = pd.DataFrame(myDict1, index=[0,1,2,3])

In [64]:
myFrame1

  Name      Sports  Calories
0    A  Basketball       100
1    B    Football       200
2    C      Tennis       300
3    D     Running       400

In [65]:
myDict2 = {"Name": ["E", "F", "G", "H"],
           "Sports": ["Basketball", "Football", "Tennis", "Running"],
           "Calories": [200, 50, 400, 300]
          }

In [66]:
myFrame2 = pd.DataFrame(myDict2, index=[4,5,6,7])

In [67]:
myFrame2

  Name      Sports  Calories
4    E  Basketball       200
5    F    Football        50
6    G      Tennis       400
7    H     Running       300

In [68]:
myDict3 = {"Name": ["I", "J", "K", "L"],
           "Sports": ["Basketball", "Football", "Tennis", "Running"],
           "Calories": [250, 100, 75, 200]
          }

In [69]:
myFrame3 = pd.DataFrame(myDict3, index=[8,9,10,11])

In [70]:
myFrame3

   Name      Sports  Calories
8     I  Basketball       250
9     J    Football       100
10    K      Tennis        75
11    L     Running       200

In [71]:
#concatenation

In [72]:
pd.concat([myFrame1, myFrame2, myFrame3])

   Name      Sports  Calories
0     A  Basketball       100
1     B    Football       200
2     C      Tennis       300
3     D     Running       400
4     E  Basketball       200
5     F    Football        50
6     G      Tennis       400
7     H     Running       300
8     I  Basketball       250
9     J    Football       100
10    K      Tennis        75
11    L     Running       200

In [73]:
#merge

In [74]:
pd.merge(myFrame1, myFrame2, on="Sports")

  Name_x      Sports  Calories_x Name_y  Calories_y
0      A  Basketball         100      E         200
1      B    Football         200      F          50
2      C      Tennis         300      G         400
3      D     Running         400      H         300

In [76]:
newSalaryFrame = pd.DataFrame({"Name": ["James", "Kirk", "Lars"], "Salary": [10,20,30], "Age": [60,65,70]})

In [77]:
newSalaryFrame

    Name  Salary  Age
0  James      10   60
1   Kirk      20   65
2   Lars      30   70

In [87]:
newSalaryFrame["Name"].unique()

array(['James', 'Kirk', 'Lars'], dtype=object)

In [88]:
newSalaryFrame["Name"].nunique()

3

In [89]:
def grossToNet(salary):
    return salary * 0.65

In [91]:
newSalaryFrame["Salary"].apply(grossToNet)

0     6.5
1    13.0
2    19.5
Name: Salary, dtype: float64